/**
 * 根据时间段，生成问候语
 */
const greeting = () => {
    const currentTime = new Date();
    const currentHour = currentTime.getHours();
    if (currentHour >= 6 && currentHour < 9) {
        return "早上好";
    } else if (currentHour >= 9 && currentHour < 12) {
        return "上午好";
    } else if (currentHour >= 12 && currentHour < 14) {
        return "中午好";
    } else if (currentHour >= 14 && currentHour < 17) {
        return "下午好";
    } else {
        return "晚上好";
    }
}

// 优美句子
const textArray = [
    "当清晨的第一缕阳光穿过窗帘，带来温暖的拥抱时，世界仿佛都变得美好起来。",
    "微风拂过脸庞，带来花香与沁人心脾的清新，让人心旷神怡。",
    "在大自然的怀抱中，感受到的不仅是宁静与美丽，更是内心的宁静与放松。",
    "每一次的微笑都是生命中最美好的礼物，让我们用心去珍惜并传递。",
    "当我们望向星空，看到点点繁星闪烁，心中涌起的是对宇宙的敬畏和对生命的感恩。",
    "爱是一种力量，能够战胜一切困难，让世界变得更加美好。",
    "在日复一日的生活里，不要忘记停下脚步，感受生命中的每一处美好。",
    "生命中最美好的时刻往往隐藏在平凡之中，用心去感受，便会发现其中的温馨与幸福。",
    "当我们用心倾听，才能听到大自然细微的声音，感受到生命中无声的美好。",
    "每一次与亲人朋友的相聚都是一次珍贵的礼物，让我们珍惜每一个拥抱与笑容。",
    "生活就像一杯清茶，苦涩中带着淡淡的甜，懂得品味，才能体会到其中的滋味。",
    "即使在最黑暗的夜晚，也总会有星星为我们指引前进的方向，带给我们希望与勇气。",
    "在繁忙的都市中，偶尔停下脚步，仰望蓝天白云，感受大自然的美好。",
    "勇敢面对生活中的挑战，即使跌倒也要勇敢站起来，因为明天依然充满了希望。",
    "在生活的每一个角落，都有值得我们感恩的事物，让我们心存感激，珍惜拥有的一切。",
    "生活就像一本书，每一页都写满了不同的故事，让我们用心去阅读，体会其中的精彩。",
    "梦想是生命的灯塔，指引我们前行的方向，让我们坚持不懈，追逐心中的梦想。",
    "在茫茫人海中，总会遇到那个与你心灵相通的人，让我们珍惜这份温暖与陪伴。",
    "用一颗宽容的心去包容世界，用一份善良的情怀去温暖他人，让世界变得更加美好。",
    "生活中最大的幸福就是拥有一个爱你的家庭，一个真心关怀你的朋友。",
    "即使路途再远，只要心中有目标，就能坚持走到最后，收获属于自己的幸福。",
    "在人生的道路上，不要害怕迷失方向，因为每一次迷失都是成长的开始。",
    "每一次的挫折都是人生的一堂课，让我们在失败中汲取教训，不断前行。",
    "坚持不懈的努力，才是成功的关键，让我们怀揣梦想，勇敢前行。",
    "每一次的告别都是一次新的开始，让我们怀揣希望，勇敢面对未来。",
    "生活中最美好的事物往往是免费赠送的，比如阳光、微风和爱的拥抱。",
    "让我们用一颗感恩的心去面对生活，因为感恩能够让生活更加美好。",
    "即使一切都变得艰难，也要相信明天会更好，因为每一次的努力都不会白费。",
    "当我们静静地融入大自然的怀抱时，感受到的不只是清新的空气，更是内心的宁静与安宁。",
    "在每一个日出日落的时刻，都能感受到生命的美好与脆弱，让我们珍惜当下，感恩拥有。",
    "即使遇到挑战和困难，也要坚信自己的力量，相信明天会更加美好。",
    "生活中的每一次相遇都是注定的，让我们怀着感恩之心，与每一个人共同成长。",
    "阳光透过树叶的缝隙洒落在身上，温暖而舒适，仿佛大自然在为我们编织温馨的庇护。",
    "人生就像一首美妙的乐曲，有高潮也有低谷，每一种音符都是生命中不可或缺的一部分。",
    "在温柔的风中，我们能够感受到大自然对我们的呵护，让我们心怀感激，珍惜这份温暖。",
    "即使在黑夜降临时，星星的光芒仍然照亮了前行的道路，带给我们无尽的勇气和希望。",
    "生活中的每一个微笑都是一种力量，能够驱散阴霾，点亮前行的路途。",
    "在繁忙的都市中，偶尔停下脚步，仰望星空，感受宇宙的浩瀚与神秘，让心灵得到净化。",
    "每一次的坚持都是一种成长，让我们相信，只要持之以恒，就能够创造奇迹。",
    "即使在最艰难的时刻，也要保持微笑，因为微笑能够驱散阴霾，带来温暖与希望。",
    "生命中最美好的事物往往是那些简单而纯粹的感动，让我们用心去品味，感受生命的美好。",
    "每一个晨曦都是一个新的开始，让我们怀揣希望，勇敢迎接生活的挑战。",
    "在生活的每一个角落，都有值得我们感恩的事物，让我们心存感激，珍惜拥有的一切。"
];

/**
 * 随机获取一些文本
 */
const getRandomTexts = () => {
    const selectedTexts = [];
    const numTexts = Math.floor(Math.random() * 2) + 3; // 随机选择 3 到 4 条文本

    // 从原始文本数组中随机选择文本，并将其添加到选定的文本数组中
    for (let i = 0; i < numTexts; i++) {
        const randomIndex = Math.floor(Math.random() * textArray.length);
        if (selectedTexts.includes(textArray[randomIndex])) {
            continue;
        }
        selectedTexts.push(textArray[randomIndex]);
    }

    return selectedTexts;
}

export default {
    greeting,
    getRandomTexts
}